export const questionSets = { 
    1: [
    { 
      id: '1', 
      question: "기분이 가라앉거나, 우울하거나, 희망이 없다고 느꼈다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
    { 
      id: '2', 
      question: "평소 하던 일에 대한 흥미가 없어지거나 즐거움을 느끼지 못했다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
    { 
      id: '3', 
      question: "잠들기가 어렵거나 자주 깼다 / 혹은 너무 많이 잤다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
    { 
      id: '4', 
      question: "평소보다 식욕이 줄었다 / 혹은 평소보다 많이 먹었다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
    { 
      id: '5', 
      question: "다른 사람들이 눈치 챌 정도로 평소보다 말과 행동이 느려졌다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
    { 
      id: '6', 
      question: "피곤하고 기운이 없었다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
    { 
      id: '7', 
      question: "내가 잘못 했거나, 실패했다는 생각이 들었다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
    { 
      id: '8', 
      question: "신문을 읽거나 TV를 보는 것과 같은 일상적인 일에도 집중 할 수가 없었다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
    { 
      id: '9', 
      question: "차라리 죽는 것이 더 낫겠다고 생각했다 / 혹은 자해할 생각을 했다.", 
      options: ["없음", "2-6일", "7-12일", "거의 매일"], 
      scoreMap: { "없음": 0, "2-6일": 1, "7-12일": 2, "거의 매일": 3 }
    },
  ],
   2: [
    { 
        id: '1', 
        question: "나는 걱정 때문에 정말 괴롭다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '2', 
        question: "나는 어떤 일에 대해서도 걱정하지 않는다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 3, "가끔 그렇다": 2, "자주 그렇다": 1, "항상 그렇다": 0 }
      },
      { 
        id: '3', 
        question: "많은 일들이 나를 걱정하게 만든다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '4', 
        question: "나는 걱정해서는 안되는 것을 알지만, 어쩔수 없다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '5', 
        question: "나는 스트레스를 받으면 걱정을 많이 한다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '6', 
        question: "나는 항상 무엇인가를 걱정하고 있다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '7', 
        question: "나는 마음만 먹으면, 걱정하던 것을 쉽게 멈출 수 있다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 3, "가끔 그렇다": 2, "자주 그렇다": 1, "항상 그렇다": 0 }
      },
      { 
        id: '8', 
        question: "나는 한 가지 일을 마치면 또 다른 일들에 대하여 걱정하기 시작한다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '9', 
        question: "나는 어떤 일에 대해서도 전혀 걱정하지 않는다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 3, "가끔 그렇다": 2, "자주 그렇다": 1, "항상 그렇다": 0 }
      },
      { 
        id: '10', 
        question: "나는 지금까지 걱정이 많은 아이였다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '11', 
        question: "나는 어떤 일에 대해서 이전부터 걱정하고 있다는 것을 알고 있다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '12', 
        question: "나는 한번 걱정하기 시작하면 멈출 수가 없다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '13', 
        question: "나는 항상 걱정하고 지낸다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
      { 
        id: '14', 
        question: "나는 어떤 일이 끝날 때까지는 그 일에 대해 계속 걱정한다.", 
        options: ["전혀 그렇지 않다", "가끔 그렇다", "자주 그렇다", "항상 그렇다"], 
        scoreMap: { "전혀 그렇지 않다": 0, "가끔 그렇다": 1, "자주 그렇다": 2, "항상 그렇다": 3 }
      },
  ],
   3: [
    { 
        id: '1', 
        question: "나는 남들만큼 가치있는 사람이다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '2', 
        question: "나에게는 좋은 점이 많다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '3', 
        question: "나는 남들만큼 일을 해낼 수 있다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '4', 
        question: "내게는 자랑으로 여길만한 것이 별로 없다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '5', 
        question: "나는 나 자신에 대해 괜찮게 생각한다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '6', 
        question: "대체로 봐서 나는 실패자이다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '7', 
        question: "대체로 나는 나를 만족스럽게 생각한다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '8', 
        question: "나는 자존심이 좀 더 있었으면 좋겠다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '9', 
        question: "나는 정말 가치없는 사람으로 생각될 때가 있다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    },
    { 
        id: '10', 
        question: "나는 내가 좋은 점이 하나도 없다고 생각될 때가 있다.", 
        options: [ "매우 그렇지 않다", "대체로 그렇지 않다", "보통이다", "대체로 그렇다", "항상 그렇다"],
        scoreMap: { "매우 그렇지 않다": 1, "대체로 그렇지 않다": 2, "보통이다": 3, "대체로 그렇다": 4, "항상 그렇다": 5 }  
    }
  ],
  4: [
    { 
        id: '1', 
        question: " 최근 2주동안 잠들기가 어렵다.", 
        options: [ "전혀 없음", "약간 있음", "중간", "심함", "매우 심함"],
        scoreMap: { "전혀 없음": 0, "약간 있음": 1, "중간": 2, "심함": 3, "매우 심함": 4 }  
    },
    { 
        id: '2', 
        question: " 최근 2주동안 잠을 유지하기 어렵다(혹은 자주 깬다).", 
        options: [ "전혀 없음", "약간 있음", "중간", "심함", "매우 심함"],
        scoreMap: { "전혀 없음": 0, "약간 있음": 1, "중간": 2, "심함": 3, "매우 심함": 4 }  
    },
    { 
        id: '3', 
        question: " 최근 2주동안 새벽에 너무 일찍 잠에서 깬다.", 
        options: [ "전혀 없음", "약간 있음", "중간", "심함", "매우 심함"],
        scoreMap: { "전혀 없음": 0, "약간 있음": 1, "중간": 2, "심함": 3, "매우 심함": 4 }  
    },
    { 
        id: '4', 
        question: "당신의 수면 패턴에 얼마나 만족하십니까?", 
        options: [ "매우 만족함", "만족함", "중간", "불만족", "매우 불만족"],
        scoreMap: { "매우 만족함": 0, "만족함": 1, "중간": 2, "불만족": 3, "매우 불만족": 4 }  
    },
    { 
        id: '5', 
        question: "불면증으로 인한 삶의 질 손상 정도가 다른 사람들에게 어떻게 보인다고 생각합니까?", 
        options: [ "전혀 현저하지 않음", "조금 현저함", "다소 현저함", "많이 현저함", "매우 많이 현저함"],
        scoreMap: { "전혀 현저하지 않음": 0, "조금 현저함": 1, "다소 현저함": 2, "많이 현저함": 3, "매우 많이 현저함": 4 }  
    },
    { 
        id: '6', 
        question: "현재 불면증에 관하여 얼마나 걱정하고 있습니까?", 
        options: [ "전혀 걱정하지 않음", "조금 걱정함", "다소 걱정함", "많이 걱정함", "매우 많이 걱정함" ],
        scoreMap: { "전혀 걱정하지 않음": 0, "조금 걱정함": 1, "다소 걱정함": 2, "많이 걱정함": 3, "매우 많이 걱정함": 4 }  
    },
    { 
        id: '7', 
        question: "당신의 수면 문제가 일상생활을 어느 정도 방해한다고 생각합니까?", 
        options: [ "전혀 방해되지 않음", "조금 방해됨", "다소 방해됨", "많이 방해됨", "매우 많이 방해됨" ],
        scoreMap: { "전혀 방해되지 않음": 0, "조금 방해됨": 1, "다소 방해됨": 2, "많이 방해됨": 3, "매우 많이 방해됨": 4 }  
    },
  ],
};